alphaBlog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "title of article"], ["description", "body of article to test user"], ["created_at", "2018-04-04 05:08:42.540218"], ["updated_at", "2018-04-04 05:08:42.540218"], ["user_id", 2]]
---
  def create
    debugger
    @article = Article.new(article_params)
    @article.user = User.first

    if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "i just edited this title"], ["description", "testtesttesttesttesttestdragar"], ["updated_at", "2018-04-04 00:52:25.657378"], ["id", 9]]
---
  def update
    if @article.update(article_params)