alphaBlog/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "varinder9"], ["email", "varinder9@example.com"], ["updated_at", "2018-04-04 07:23:19.223785"], ["id", 5]]